# encoding = utf-8

from pymongo import MongoClient
import hashlib

client = MongoClient()
client_date = client.FuSite.date

client.FuSite.users.insert_one({
    "用户名": "这里填你的用户名", #这里填你的用户名
    "邮箱": "这里填你的邮箱", #这里填你的邮箱
    "密码": hashlib.sha256("这里填你的密码".encode("utf-8")).hexdigest(), #这里填你的密码
    "权限": 3,
    "用户id": "aM3di3j1SpEQkmb",
    "个性签名": "",
    "生日": "",
    "性别": "",
    "年龄": "",
    "个人简介": "",
    "手机号": "",
    "地址": "",
    "头像": "",
    "个人主页": "",
    "爱好": "",
    "历史记录": []
})

f_gong = eval("{'劳动节': (5, 1), '妇女节': (3, 8), '教师节': (9, 10),'元旦': (1, 1),  '中国人民警察节': (1, 10), '植树节': (3, 12), '青年节': (5, 4), '护士节': (5, 12), '全国科技工作者日': (5, 30), '儿童节': (6, 1), '中国人民解放军建军节': (8, 1), '中国医师节': (8, 19), '国庆节': (10, 1), '记者节': (11, 8), '二七纪念日': (2, 7), '全民国家安全教育日': (4, 15), '中国航天日': (4, 24), '中国品牌日': (5, 10), '全国防灾减灾日': (5, 12), '中国旅游日': (5, 19), '五卅纪念日': (5, 30), '环境日': (6, 5), '全国土地日': (6, 25), '七七抗战纪念日': (7, 7), '中国航海记': (7, 11), '中国共产党建党日': (7, 1), '全民健身日': (8, 8), '残疾预防日': (8, 25),  '中国人民抗日胜利纪念日': (9, 3), '中华慈善日': (9, 5), '九一八纪念日': (9, 18), '烈士纪念日': (9, 30), '国家扶贫日': (10, 17), '全国交通安全日': (12, 2), '国家宪法日': (12, 4), '全国法制宣传日': (12, 4), '南京大屠杀死难者国家公祭日': (12, 13)}")
f_nong = eval("{'除夕': (12, 30), '春节': (1, 1), '腊八节':(12, 8), '北方小年':(12, 23), '南方小年':(12, 24), '端午节': (5, 5), '中秋节': (8, 15), '重阳节': (9, 9), '元宵节': (1, 15), '腊八节': (12, 8)}")
f_week = eval("{'全国助残日': [5, [3, 6]], '文化和自然遗产日': [6, [2, 5]], '全民国防教育日': [9, [3, 5]], '母亲节': [5, [2, 6]], '父亲节': [6, [3, 6]]}")

client_date.drop()
client_date.insert_one({"id": "main", "date":{"f_gong": f_gong, "f_nong": f_nong, "f_week": f_week}})